include/GLANGSoapBinding.palindrome.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://soap.g-language.org/GLANG">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:palindrome>
   <sequence></sequence>
   <params>
    <gtmatch>0</gtmatch>
    <output></output>
    <loop>0</loop>
    <shortest>0</shortest>
   </params>
  </ns1:palindrome>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
